app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-03-12 21:04:24.491811"], ["id", 1]]
---
  def update
    puts "AAAAA"
    puts params[:article]
    puts "BBBBBB"
    title = params[:article][:title]
    desc = params[:article][:description]

    @article = Article.find(params[:id])
    @article.update(title: title, description: desc)